## Staging: cognito
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # aws_cognito_user_pool_client.forms will be updated in-place
  ~ resource "aws_cognito_user_pool_client" "forms" {
      ~ explicit_auth_flows                  = [
          + "ALLOW_CUSTOM_AUTH",
            # (2 unchanged elements hidden)
        ]
        id                                   = "17bsg3b2b7q5snon007rru264u"
        name                                 = "forms_client"
        # (14 unchanged attributes hidden)
    }

  # aws_lambda_function.cognito_define_auth_challenge will be created
  + resource "aws_lambda_function" "cognito_define_auth_challenge" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/define_auth_challenge_main.zip"
      + function_name                  = "Cognito_Define_Auth_Challenge"
      + handler                        = "cognito_define_auth_challenge.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::687401027353:role/iam_for_cognito_lambda"
      + runtime                        = "nodejs16.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "Cc3ASDoIutzXXiH+tnoUGVQ8DNB7U43INl4bssgjglA="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_function.cognito_email_sender will be updated in-place
  ~ resource "aws_lambda_function" "cognito_email_sender" {
        id                             = "Cognito_Email_Sender"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:687401027353:layer:cognito_email_sender_node_packages:6",
        ] -> (known after apply)
      ~ runtime                        = "nodejs14.x" -> "nodejs16.x"
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.cognito_verify_auth_challenge will be created
  + resource "aws_lambda_function" "cognito_verify_auth_challenge" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/verify_auth_challenge_main.zip"
      + function_name                  = "Cognito_Verify_Auth_Challenge"
      + handler                        = "cognito_verify_auth_challenge.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::687401027353:role/iam_for_cognito_lambda"
      + runtime                        = "nodejs16.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "YTrYt2Gc41F780tGoHTV6HXFRfCx1H6qRARMA5kdi8w="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_layer_version.cognito_email_sender_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "cognito_email_sender_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:687401027353:layer:cognito_email_sender_node_packages:6" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ compatible_runtimes         = [ # forces replacement
          - "nodejs12.x",
          - "nodejs14.x",
          + "nodejs16.x",
        ]
      ~ created_date                = "2023-04-25T19:05:39.105+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:687401027353:layer:cognito_email_sender_node_packages:6" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:687401027353:layer:cognito_email_sender_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_size            = 14101894 -> (known after apply)
      ~ version                     = "6" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 1 to destroy.

Error: Archive creation error

  with data.archive_file.cognito_create_auth_challenge_nodejs,
  on lambda.tf line 97, in data "archive_file" "cognito_create_auth_challenge_nodejs":
  97: data "archive_file" "cognito_create_auth_challenge_nodejs" {

error creating archive: error archiving directory: could not archive missing
directory: lambda/cognito_create_auth_challenge
time=2023-05-11T17:28:55Z level=error msg=1 error occurred:
	* exit status 1



```

</details>

